<?xml version="1.0" ?>
<net name="RMNet_LReLU with SSD head for Action Detection and Action Recognition" version="10">
	<layers>
		<layer id="0" name="data" type="Parameter" version="opset1">
			<data element_type="f16" shape="1,3,400,680"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="data_mul_4351745396/EltwiseUnsqueeze45819_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1,3,1,1" size="6"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="data/norm/bn/mean/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>680</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_add_4351945397/EltwiseUnsqueeze45823_const" type="Const" version="opset1">
			<data element_type="f16" offset="6" shape="1,3,1,1" size="6"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="data/norm/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>680</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>680</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="init_block1/dim_inc/bn/mean/Fused_Mul_4811248114_const" type="Const" version="opset1">
			<data element_type="f16" offset="12" shape="32,3,3,3" size="1728"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="init_block1/dim_inc/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>400</dim>
					<dim>680</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="data_add_435224352745399/EltwiseUnsqueeze45831_const" type="Const" version="opset1">
			<data element_type="f16" offset="1740" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="init_block1/dim_inc/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="init_block1/dim_inc/fn" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="bottleneck1_1/dim_red/bn/mean/Fused_Mul_4811648118_const" type="Const" version="opset1">
			<data element_type="f16" offset="1804" shape="8,32,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="bottleneck1_1/dim_red/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="data_add_435304353545401/EltwiseUnsqueeze45839_const" type="Const" version="opset1">
			<data element_type="f16" offset="2316" shape="1,8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="bottleneck1_1/dim_red/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="bottleneck1_1/dim_red/fn/Cast_172273_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="bottleneck1_1/dim_red/fn" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="7051670519_const" type="Const" version="opset1">
			<data element_type="f16" offset="2336" shape="8,1,1,3,3" size="144"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="bottleneck1_1/inner/dw1/conv" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="data_add_435384354345403/EltwiseUnsqueeze45847_const" type="Const" version="opset1">
			<data element_type="f16" offset="2480" shape="1,8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="bottleneck1_1/inner/dw1/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="bottleneck1_1/inner/dw1/fn/Cast_172245_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="bottleneck1_1/inner/dw1/fn" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="bottleneck1_1/dim_inc/bn/mean/Fused_Mul_4812448126_const" type="Const" version="opset1">
			<data element_type="f16" offset="2496" shape="32,8,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="bottleneck1_1/dim_inc/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="data_add_435464355145405/EltwiseUnsqueeze45855_const" type="Const" version="opset1">
			<data element_type="f16" offset="3008" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="bottleneck1_1/dim_inc/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="bottleneck1_1/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="bottleneck1_1/fn/Cast_172313_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="bottleneck1_1/fn" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="bottleneck1_2/dim_red/bn/mean/Fused_Mul_4812848130_const" type="Const" version="opset1">
			<data element_type="f16" offset="3072" shape="8,32,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="bottleneck1_2/dim_red/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="data_add_435544355945407/EltwiseUnsqueeze45863_const" type="Const" version="opset1">
			<data element_type="f16" offset="3584" shape="1,8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="bottleneck1_2/dim_red/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="bottleneck1_2/dim_red/fn/Cast_171971_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="bottleneck1_2/dim_red/fn" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="7054070543_const" type="Const" version="opset1">
			<data element_type="f16" offset="3600" shape="8,1,1,3,3" size="144"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="bottleneck1_2/inner/dw1/conv" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="data_add_435624356745409/EltwiseUnsqueeze45871_const" type="Const" version="opset1">
			<data element_type="f16" offset="3744" shape="1,8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="bottleneck1_2/inner/dw1/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="bottleneck1_2/inner/dw1/fn/Cast_172049_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="bottleneck1_2/inner/dw1/fn" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="bottleneck1_2/dim_inc/bn/mean/Fused_Mul_4813648138_const" type="Const" version="opset1">
			<data element_type="f16" offset="3760" shape="32,8,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="bottleneck1_2/dim_inc/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="data_add_435704357545411/EltwiseUnsqueeze45879_const" type="Const" version="opset1">
			<data element_type="f16" offset="4272" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="bottleneck1_2/dim_inc/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="bottleneck1_2/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="bottleneck1_2/fn/Cast_171943_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="bottleneck1_2/fn" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="bottleneck1_3/dim_red/bn/mean/Fused_Mul_4814048142_const" type="Const" version="opset1">
			<data element_type="f16" offset="4336" shape="8,32,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="bottleneck1_3/dim_red/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="data_add_435784358345413/EltwiseUnsqueeze45887_const" type="Const" version="opset1">
			<data element_type="f16" offset="4848" shape="1,8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="bottleneck1_3/dim_red/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="bottleneck1_3/dim_red/fn/Cast_172311_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="bottleneck1_3/dim_red/fn" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="7048070483_const" type="Const" version="opset1">
			<data element_type="f16" offset="4864" shape="8,1,1,3,3" size="144"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="bottleneck1_3/inner/dw1/conv" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="data_add_435864359145415/EltwiseUnsqueeze45895_const" type="Const" version="opset1">
			<data element_type="f16" offset="5008" shape="1,8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="bottleneck1_3/inner/dw1/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="bottleneck1_3/inner/dw1/fn/Cast_171983_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="bottleneck1_3/inner/dw1/fn" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="bottleneck1_3/dim_inc/bn/mean/Fused_Mul_4814848150_const" type="Const" version="opset1">
			<data element_type="f16" offset="5024" shape="32,8,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="bottleneck1_3/dim_inc/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="data_add_435944359945417/EltwiseUnsqueeze45903_const" type="Const" version="opset1">
			<data element_type="f16" offset="5536" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="bottleneck1_3/dim_inc/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="bottleneck1_3/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="bottleneck1_3/fn/Cast_172139_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="bottleneck1_3/fn" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="bottleneck1_4/dim_red/bn/mean/Fused_Mul_4815248154_const" type="Const" version="opset1">
			<data element_type="f16" offset="5600" shape="8,32,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="bottleneck1_4/dim_red/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="data_add_436024360745419/EltwiseUnsqueeze45911_const" type="Const" version="opset1">
			<data element_type="f16" offset="6112" shape="1,8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="bottleneck1_4/dim_red/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="bottleneck1_4/dim_red/fn/Cast_172175_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="bottleneck1_4/dim_red/fn" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="7044070443_const" type="Const" version="opset1">
			<data element_type="f16" offset="6128" shape="8,1,1,3,3" size="144"/>
			<output>
				<port id="1" precision="FP16">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="bottleneck1_4/inner/dw1/conv" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="data_add_436104361545421/EltwiseUnsqueeze45919_const" type="Const" version="opset1">
			<data element_type="f16" offset="6272" shape="1,8,1,1" size="16"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="bottleneck1_4/inner/dw1/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="bottleneck1_4/inner/dw1/fn/Cast_172051_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="bottleneck1_4/inner/dw1/fn" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="bottleneck1_4/dim_inc/bn/mean/Fused_Mul_4816048162_const" type="Const" version="opset1">
			<data element_type="f16" offset="6288" shape="32,8,1,1" size="512"/>
			<output>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="bottleneck1_4/dim_inc/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="data_add_436184362345423/EltwiseUnsqueeze45927_const" type="Const" version="opset1">
			<data element_type="f16" offset="6800" shape="1,32,1,1" size="64"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="bottleneck1_4/dim_inc/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="bottleneck1_4/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="bottleneck1_4/fn/Cast_171973_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="bottleneck1_4/fn" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="bottleneck2_0/skip/pooling" type="MaxPool" version="opset1">
			<data kernel="2,2" pads_begin="0,0" pads_end="0,0" rounding_type="ceil" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="bottleneck2_0/skip/bn/mean/Fused_Mul_4816448166_const" type="Const" version="opset1">
			<data element_type="f16" offset="6864" shape="64,32,1,1" size="4096"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="bottleneck2_0/skip/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="data_add_436264363145425/EltwiseUnsqueeze45935_const" type="Const" version="opset1">
			<data element_type="f16" offset="10960" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="bottleneck2_0/skip/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="bottleneck2_0/dim_red/bn/mean/Fused_Mul_4816848170_const" type="Const" version="opset1">
			<data element_type="f16" offset="11088" shape="16,32,1,1" size="1024"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="bottleneck2_0/dim_red/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="data_add_436344363945427/EltwiseUnsqueeze45943_const" type="Const" version="opset1">
			<data element_type="f16" offset="12112" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="bottleneck2_0/dim_red/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="bottleneck2_0/dim_red/fn/Cast_172297_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="bottleneck2_0/dim_red/fn" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="7050470507_const" type="Const" version="opset1">
			<data element_type="f16" offset="12144" shape="16,1,1,3,3" size="288"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="bottleneck2_0/inner/dw1/conv" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>200</dim>
					<dim>340</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="data_add_436424364745429/EltwiseUnsqueeze45951_const" type="Const" version="opset1">
			<data element_type="f16" offset="12432" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="bottleneck2_0/inner/dw1/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="bottleneck2_0/inner/dw1/fn/Cast_172073_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="bottleneck2_0/inner/dw1/fn" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="bottleneck2_0/dim_inc/bn/mean/Fused_Mul_4817648178_const" type="Const" version="opset1">
			<data element_type="f16" offset="12464" shape="64,16,1,1" size="2048"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="bottleneck2_0/dim_inc/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="data_add_436504365545431/EltwiseUnsqueeze45959_const" type="Const" version="opset1">
			<data element_type="f16" offset="14512" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="bottleneck2_0/dim_inc/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="bottleneck2_0/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="bottleneck2_0/fn/Cast_172229_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="bottleneck2_0/fn" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="bottleneck2_1/dim_red/bn/mean/Fused_Mul_4818048182_const" type="Const" version="opset1">
			<data element_type="f16" offset="14640" shape="16,64,1,1" size="2048"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="bottleneck2_1/dim_red/conv" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="data_add_436584366345433/EltwiseUnsqueeze45967_const" type="Const" version="opset1">
			<data element_type="f16" offset="16688" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="bottleneck2_1/dim_red/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="bottleneck2_1/dim_red/fn/Cast_172167_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="bottleneck2_1/dim_red/fn" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="7052070523_const" type="Const" version="opset1">
			<data element_type="f16" offset="16720" shape="16,1,1,3,3" size="288"/>
			<output>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="bottleneck2_1/inner/dw1/conv" type="GroupConvolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="data_add_436664367145435/EltwiseUnsqueeze45975_const" type="Const" version="opset1">
			<data element_type="f16" offset="17008" shape="1,16,1,1" size="32"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="bottleneck2_1/inner/dw1/bn/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="bottleneck2_1/inner/dw1/fn/Cast_171993_const" type="Const" version="opset1">
			<data element_type="f32" offset="2332" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="bottleneck2_1/inner/dw1/fn" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>100</dim>
					<dim>170</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="bottleneck2_1/dim_inc/bn/mean/Fused_Mul_4818848190_const" type="Const" version="opset1">
			<data element_type="f16" offset="17040" shape="64,16,1,1" size="2048"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
